In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('../raw-data/Obesity-Trends/FAOSTAT_data_en_11-5-2025.csv')
df.head()

,Domain Code,Domain,Area Code (M49),Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Note
0,FS,Suite of Food Security Indicators,4,Afghanistan,6121,Value,21042,Prevalence of obesity in the adult population ...,2000,2000,%,4.3,X,Figure from external organization,NaN
1,FS,Suite of Food Security Indicators,4,Afghanistan,6121,Value,21042,Prevalence of obesity in the adult population ...,2001,2001,%,4.6,X,Figure from external organization,NaN
2,FS,Suite of Food Security Indicators,4,Afghanistan,6121,Value,21042,Prevalence of obesity in the adult population ...,2002,2002,%,5.0,X,Figure from external organization,NaN
3,FS,Suite of Food Security Indicators,4,Afghanistan,6121,Value,21042,Prevalence of obesity in the adult population ...,2003,2003,%,5.4,X,Figure from external organization,NaN
4,FS,Suite of Food Security Indicators,4,Afghanistan,6121,Value,21042,Prevalence of obesity in the adult population ...,2004,2004,%,5.8,X,Figure from external organization,NaN

In [4]:
df.columns

Index(['Domain Code', 'Domain', 'Area Code (M49)', 'Area', 'Element Code',
       'Element', 'Item Code', 'Item', 'Year Code', 'Year', 'Unit', 'Value',
       'Flag', 'Flag Description', 'Note'],
      dtype='object')

In [5]:
df.duplicated().sum()

0

In [5]:
df.isnull().sum()

Domain Code            0
Domain                 0
Area Code (M49)        0
Area                   0
Element Code           0
Element                0
Item Code              0
Item                   0
Year Code              0
Year                   0
Unit                   0
Value                  0
Flag                   0
Flag Description       0
Note                4554
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4554 entries, 0 to 4553
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       4554 non-null   object
 1   Domain            4554 non-null   object
 2   Area Code (M49)   4554 non-null   int64
 3   Area              4554 non-null   object
 4   Element Code      4554 non-null   int64
 5   Element           4554 non-null   object
 6   Item Code         4554 non-null   int64
 7   Item              4554 non-null   object
 8   Year Code         4554 non-null   int64
 9   Year              4554 non-null   int64
 10  Unit              4554 non-null   object
 11  Value             4554 non-null   float64
 12  Flag              4554 non-null   object
 13  Flag Description  4554 non-null   object
 14  Note              0 non-null      float64
dtypes: float64(2), int64(5), object(8)
memory usage: 533.8+ KB

In [7]:
df.describe()

,Area Code (M49),Element Code,Item Code,Year Code,Year,Value,Note
count,4554.000000,4554.0,4554.0,4554.000000,4554.000000,4554.000000,0.0
mean,426.934343,6121.0,21042.0,2011.000000,2011.000000,19.567479,NaN
std,255.896239,0.0,0.0,6.633978,6.633978,13.526510,NaN
min,4.000000,6121.0,21042.0,2000.000000,2000.000000,0.300000,NaN
25%,204.000000,6121.0,21042.0,2005.000000,2005.000000,9.500000,NaN
50%,420.000000,6121.0,21042.0,2011.000000,2011.000000,18.200000,NaN
75%,646.000000,6121.0,21042.0,2017.000000,2017.000000,25.500000,NaN
max,894.000000,6121.0,21042.0,2022.000000,2022.000000,75.200000,NaN

In [8]:
df = df.drop(columns=['Domain Code', 'Domain', 'Area Code (M49)', 'Element Code', 'Element', 'Item Code', 'Item', 'Year Code', 'Unit', 'Flag', 'Flag Description', 'Note'])
df.head()

          Area  Year  Value
0  Afghanistan  2000    4.3
1  Afghanistan  2001    4.6
2  Afghanistan  2002    5.0
3  Afghanistan  2003    5.4
4  Afghanistan  2004    5.8

In [9]:
df_pivot = df.pivot_table(index='Area', columns='Year', values='Value')
df_pivot.head()

Year,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
Area,,,,,,,,,,,,,,,,,,,,,
Afghanistan,4.3,4.6,5.0,5.4,5.8,6.2,6.7,7.2,7.8,8.3,...,11.0,11.7,12.6,13.4,14.3,15.3,16.2,17.2,18.2,19.2
Albania,12.8,13.1,13.4,13.7,14.1,14.5,14.8,15.3,15.7,16.1,...,18.0,18.5,19.1,19.6,20.2,20.8,21.4,22.0,22.7,23.4
Algeria,13.4,13.9,14.3,14.7,15.2,15.6,16.0,16.5,16.9,17.4,...,19.2,19.7,20.2,20.8,21.3,21.8,22.3,22.8,23.3,23.8
American Samoa,68.4,68.8,69.1,69.4,69.7,70.0,70.3,70.6,71.0,71.3,...,72.6,72.9,73.2,73.5,73.8,74.1,74.4,74.7,74.9,75.2
Andorra,13.7,14.0,14.4,14.7,15.0,15.3,15.6,15.8,16.1,16.3,...,16.8,16.9,17.0,17.1,17.3,17.4,17.6,17.7,17.9,18.1

In [10]:
df_pivot = df_pivot.reset_index()
df_pivot.head()

Year,Area,2000,2001,2002,2003,2004,2005,2006,2007,2008,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
0,Afghanistan,4.3,4.6,5.0,5.4,5.8,6.2,6.7,7.2,7.8,...,11.0,11.7,12.6,13.4,14.3,15.3,16.2,17.2,18.2,19.2
1,Albania,12.8,13.1,13.4,13.7,14.1,14.5,14.8,15.3,15.7,...,18.0,18.5,19.1,19.6,20.2,20.8,21.4,22.0,22.7,23.4
2,Algeria,13.4,13.9,14.3,14.7,15.2,15.6,16.0,16.5,16.9,...,19.2,19.7,20.2,20.8,21.3,21.8,22.3,22.8,23.3,23.8
3,American Samoa,68.4,68.8,69.1,69.4,69.7,70.0,70.3,70.6,71.0,...,72.6,72.9,73.2,73.5,73.8,74.1,74.4,74.7,74.9,75.2
4,Andorra,13.7,14.0,14.4,14.7,15.0,15.3,15.6,15.8,16.1,...,16.8,16.9,17.0,17.1,17.3,17.4,17.6,17.7,17.9,18.1

In [14]:
df_pivot.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 198 entries, 0 to 197
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Area    198 non-null    object
 1   2000    198 non-null    float64
 2   2001    198 non-null    float64
 3   2002    198 non-null    float64
 4   2003    198 non-null    float64
 5   2004    198 non-null    float64
 6   2005    198 non-null    float64
 7   2006    198 non-null    float64
 8   2007    198 non-null    float64
 9   2008    198 non-null    float64
 10  2009    198 non-null    float64
 11  2010    198 non-null    float64
 12  2011    198 non-null    float64
 13  2012    198 non-null    float64
 14  2013    198 non-null    float64
 15  2014    198 non-null    float64
 16  2015    198 non-null    float64
 17  2016    198 non-null    float64
 18  2017    198 non-null    float64
 19  2018    198 non-null    float64
 20  2019    198 non-null    float64
 21  2020    198 non-null    float64
 22  2021    198 non-null    float64
 23  2022    198 non-null    float64
dtypes: float64(23), object(1)
memory usage: 37.3+ KB

In [12]:
df_pivot.describe()

Year,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
count,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000,...,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000,198.000000
mean,15.022222,15.445455,15.872222,16.299495,16.721212,17.138889,17.558586,17.967677,18.376768,18.780808,...,20.327273,20.719192,21.122222,21.540909,21.968182,22.394444,22.837879,23.290909,23.758081,24.235859
std,12.208677,12.315870,12.419192,12.523292,12.616766,12.718046,12.805016,12.899957,13.001061,13.108568,...,13.483141,13.570561,13.660470,13.745611,13.834106,13.913391,13.995918,14.076792,14.144175,14.216366
min,0.300000,0.300000,0.300000,0.400000,0.400000,0.400000,0.500000,0.500000,0.600000,0.600000,...,0.900000,1.000000,1.100000,1.200000,1.300000,1.400000,1.600000,1.700000,1.900000,2.000000
25%,5.325000,5.600000,5.900000,6.200000,6.525000,6.825000,7.150000,7.450000,7.850000,8.325000,...,10.100000,10.475000,10.900000,11.225000,11.500000,11.750000,12.050000,12.475000,13.100000,13.400000
50%,13.800000,14.100000,14.450000,14.850000,15.250000,15.700000,16.200000,16.800000,17.450000,17.950000,...,19.100000,19.500000,19.900000,20.350000,20.550000,21.100000,21.400000,21.850000,22.100000,22.650000
75%,18.775000,19.375000,19.975000,20.500000,21.075000,21.525000,22.000000,22.600000,23.275000,23.975000,...,25.750000,26.375000,27.000000,27.500000,28.100000,28.675000,29.350000,30.000000,30.675000,31.375000
max,68.400000,68.800000,69.100000,69.400000,69.700000,70.000000,70.300000,70.600000,71.000000,71.300000,...,72.600000,72.900000,73.200000,73.500000,73.800000,74.100000,74.400000,74.700000,74.900000,75.200000

In [6]:
df_pivot.to_csv('../data/clean_obesity_data.csv', index=False)
print("df_pivot saved as 'clean_obesity_data.csv'")

NameError: name 'df_pivot' is not defined